# Gathering Data

In [2]:
# Import libraries
import pandas as pd

In [6]:
# Read from csv
pd.read_csv('Data/course_offerings.csv', sep=',', header=0)

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [12]:
# Read from excel
pd.read_excel('Data/Course Offerings.xlsx')

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

In [13]:
# Connect to a sqlite database and read from sql
import sqlite3

In [14]:
conn = sqlite3.connect('Data/maven.db')

In [15]:
pd.read_sql('SELECT * FROM courses', conn)

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao